# taps
tap "homebrew/bundle"

# packages
brew 'vim'
brew 'git'

brew 'zsh'
brew 'tmux'
brew 'ripgrep'
brew 'bat'
brew 'fd'
brew 'helix'
brew 'jq'
brew 'mas'
brew 'hugo'
brew 'multimarkdown'

# tools
cask 'emacs'
# export org mode file to pdf
cask 'mactex'
cask 'microsoft-edge'
cask 'google-chrome'
cask 'notion'
# replace alred
cask 'raycast'
# cask 'alfred'
cask 'warp'
cask 'intellij-idea-ce'
cask 'sequel-pro'
cask 'clashx'
cask 'docker'
cask 'wireshark'
cask 'tunnelblick'

cask 'spotify'

# language
# cask 'java'
brew 'maven'

brew 'rust'
brew 'rust-analyzer'
brew 'rustfmt'

brew 'go'
brew 'gopls'

brew 'cmake'

brew 'yarn'

# install apps from apple store: 1. mas search <keyword>, find id 2. add one line below 
mas "MindNode", id: 1289197285
mas "CopyClip", id: 595191960
mas "QQ音乐", id: 595615424
